<template>  
    <div id="game">
        <h3>{{ this.$route.query.id }}</h3> <h3>{{ this.$route.query.stage }}</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> <h3>王者荣耀</h3> 
    </div> 
</template>  
<script>
export default {
    created(){
        let ids = this.$route.query.stage;
        console.log(ids);
    }
}
</script>

<style scoped>
 #game {
     height: 500px;
 }
</style>
